0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DCDC_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DCDC_0</groupName>
			<baseAddress>0x4004e000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>DCDC_IRQn</name>
				<value>40</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x0C0C0000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RDYLOWF</name>
							<description>DC-DC Converter Ready Low Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The output voltage (VDC) is below the threshold set in the RDYLOWTH threshold field (RDYLOWTH).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The output voltage (VDC) is above the threshold set in the RDYLOWTH threshold field (RDYLOWTH).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDYHIGHF</name>
							<description>DC-DC Converter Ready High Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The output voltage (VDC) has not exceeded 105% of the programmed output value.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The output voltage (VDC) has exceeded 105% of the programmed output value.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DROPOUTF</name>
							<description>DC-DC Converter Dropout Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The input voltage (VBATDC) is more than 0.4 V above the output voltage (VDC). The DC-DC converter is not in dropout.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The input voltage (VBATDC) is less than 0.4 V above the output voltage (VDC). The DC-DC converter is in dropout, and firmware should enable the bypass switch (BEN=1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGRDYF</name>
							<description>Bandgap Ready Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The bandgap voltage is not above the threshold.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The bandgap voltage is above the threshold.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCDIS</name>
							<description>Oscillator Disable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>Enable the DC-DC local oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Disable the DC-DC local oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Source Select. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DCDCOSC</name>
									<description>Select the local DC-DC oscillator as the clock source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>APB</name>
									<description>Select the APB clock as the clock source.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>Clock Divider. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>Use the APB clock divided by 1 as the converter switching frequency.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>Use the APB clock divided by 2 as the converter switching frequency.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>Use the APB clock divided by 4 as the converter switching frequency.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>Use the APB clock divided by 8 as the converter switching frequency.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
									<description>Use the APB clock divided by 16 as the converter switching frequency.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCSYNCEN</name>
							<description>ADC Synchronization Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not synchronize the ADC to the DC-DC converter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Synchronize the ADC to the DC-DC converter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKINVEN</name>
							<description>Clock Inversion Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the APB clock input.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the APB clock input.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCLKINVEN</name>
							<description>ADC Clock Inversion Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the ADC clock derived from the DC-DC switching frequency.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the ADC clock derived from the DC-DC switching frequency.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTVSEL</name>
							<description>Output Voltage Select. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>MIEN</name>
							<description>Module Interrupt Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable DC-DC module interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable DC-DC module interrupts.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MINPWSEL</name>
							<description>Minimum Pulse Width Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable pulse skipping.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10_NS</name>
									<description>Set the minimum pulse width to 10 ns.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_NS</name>
									<description>Set the minimum pulse width to 20 ns.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_NS</name>
									<description>Set the minimum pulse width to 40 ns.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSMD</name>
							<description>Power Switch Mode. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SWSEL0</name>
									<description>Mode 0. Set the M1 and M2 power switches to each use one MOSFET only.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SWSEL1</name>
									<description>Mode 1. Set the M1 and M2 power switches to each use 2 MOSFETS in parallel.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SWSEL2</name>
									<description>Mode 2. Set the M1 and M2 power switches to each use 3 MOSFETS in parallel.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SWSEL3</name>
									<description>Mode 3. Set the M1 and M2 power switches to each use 4 MOSFETS in parallel.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASYNCEN</name>
							<description>Asynchronous Mode Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Enable DC-DC synchronous mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable DC-DC asynchronous mode.  This mode is more efficient for very light output loads.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ABEN</name>
							<description>Automatic Bypass Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable automatic bypass.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable automatic bypass.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEN</name>
							<description>Bypass Enable. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the MBYP bypass switch.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the MBYP bypass switch.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCDCEN</name>
							<description>DC-DC Converter Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DC-DC converter.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DC-DC converter.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFIG</name>
					<description>Module Configuration</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00001F40</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ILIMIT</name>
							<description>Inductor Peak Current Limit. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIMIT1</name>
									<description>Limit the peak inductor current to 200 mA.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT2</name>
									<description>Limit the peak inductor current to 300 mA.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT3</name>
									<description>Limit the peak inductor current to 400 mA.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT4</name>
									<description>Limit the peak inductor current to 500 mA.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT5</name>
									<description>Limit the peak inductor current to 600 mA.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT6</name>
									<description>Limit the peak inductor current to 700 mA.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIMIT7</name>
									<description>Limit the peak inductor current to 800 mA.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INTMD</name>
							<description>Interrupt Mode. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>OUTPUT_TOO_LOW</name>
									<description>Generate an interrupt when the regulated converter output voltage is too low, according to the RDYLOWF flag.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUTPUT_NOT_TOO_LOW</name>
									<description>Generate an interrupt when the regulated converter output voltage is not too low according to the RDYLOWF flag.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT_OF_REG</name>
									<description>Generate an interrupt when the output voltage is out of regulation. The converter output can be either too high or too low, according to the RDYLOWF and RDYHIGHF flags.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IN_REG</name>
									<description>Generate an interrupt when the output voltage is in regulation.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDYLOWTH</name>
							<description>Converter Ready Low Threshold. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>95_PERCENT</name>
									<description>Hardware sets the RDYLOWF flag if the regulated output voltage is greater than 95% of the programmed output voltage.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>90_PERCENT</name>
									<description>Hardware sets the RDYLOWF flag if the regulated output voltage is greater than 90% of the programmed output voltage.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>85_PERCENT</name>
									<description>Hardware sets the RDYLOWF flag if the regulated output voltage is greater than 85% of the programmed output voltage.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>80_PERCENT</name>
									<description>Hardware sets the RDYLOWF flag if the regulated output voltage is greater than 80% of the programmed output voltage.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
