0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x4.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>DMACTRL_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>DMA</groupName>
			<baseAddress>0x40036000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>STATUS</name>
					<description>Controller Status</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00090000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DMAENSTS</name>
							<description>DMA Enable Status. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>DMA controller is disabled</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>DMA controller is enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATE</name>
							<description>State Machine State. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>Idle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READING_CHANNEL_CONFIG</name>
									<description>Reading channel controller data.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READING_SOURCE_POINTER</name>
									<description>Reading source data end pointer.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READING_DEST_POINTER</name>
									<description>Reading destination data end pointer.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READING_SOURCE_DATA</name>
									<description>Reading source data.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_DEST_DATA</name>
									<description>Writing destination data.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING_DMA_REQ_CLEAR</name>
									<description>Waiting for a DMA request to clear.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITING_CHANNEL_CONFIG</name>
									<description>Writing channel controller data.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STALLED</name>
									<description>Stalled.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DONE</name>
									<description>Done.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SCATTER_GATHER_TRANSITION</name>
									<description>Peripheral scatter-gather transition.</description>
									<value>10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NUMCHAN</name>
							<description>Number of Supported DMA Channels. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CONFIG</name>
					<description>Controller Configuration</description>
					<addressOffset>0x4</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DMAEN</name>
							<description>DMA Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the DMA controller.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the DMA controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BASEPTR</name>
					<description>Base Pointer</description>
					<addressOffset>0x8</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BASEPTR</name>
							<description>Control Base Pointer. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>23</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ABASEPTR</name>
					<description>Alternate Base Pointer</description>
					<addressOffset>0xc</addressOffset>
					<resetValue>0x00000100</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ABASEPTR</name>
							<description>Alternate Control Base Pointer. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSTATUS</name>
					<description>Channel Status</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x000003FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Channel 0 Status. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 0 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 0 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 Status. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 1 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 1 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 Status. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 2 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 2 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Channel 3 Status. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 3 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 3 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 Status. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 4 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 4 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5</name>
							<description>Channel 5 Status. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 5 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 5 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 Status. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 6 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 6 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 Status. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 7 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 7 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 Status. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 8 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 8 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9</name>
							<description>Channel 9 Status. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_WAITING</name>
									<description>DMA Channel 9 is not waiting for a data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WAITING</name>
									<description>DMA Channel 9 is waiting for a data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSWRCN</name>
					<description>Channel Software Request Control</description>
					<addressOffset>0x14</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CH0</name>
							<description>Channel 0 Software Request. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 0 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 0 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Channel 1 Software Request. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 1 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 1 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Channel 2 Software Request. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 2 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 2 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Channel 3 Software Request. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 3 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 3 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Channel 4 Software Request. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 4 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 4 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5</name>
							<description>Channel 5 Software Request. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 5 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 5 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Channel 6 Software Request. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 6 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 6 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Channel 7 Software Request. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 7 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 7 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Channel 8 Software Request. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 8 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 8 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9</name>
							<description>Channel 9 Software Request. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DO_NOT_GENERATE_SW_REQ</name>
									<description>DMA Channel 9 does not generate a software data request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GENERATE_SW_REQ</name>
									<description>DMA Channel 9 generates a software data request.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
