0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3L1x4.svd
				<register>
					<name>PERIPHLOCK1</name>
					<description>Peripheral Lock Control 1</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENCDECL</name>
							<description>Encoder Decoder Module Lock. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the ENCDEC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the ENCDEC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LPTIMER_0</name>
			<version>B</version>
			<description>None</description>
			<groupName>LPTIMER_0</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>LPTIMER0_IRQn</name>
				<value>4</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x20000400</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Count Mode. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREE</name>
									<description>The timer is free running mode on the RTC timer clock (RTC0TCLK).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>The timer is incremented on the rising edges of the selected external trigger (LPTnTx).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>The timer is incremented on the falling edges of the selected external trigger (LPTnTx).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ANY_EDGE</name>
									<description>The timer is incremented on both edges of the selected external trigger (LPTnTx).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTSEL</name>
							<description>External Trigger Source Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LPTNT0</name>
									<description>Select external trigger LPTnT0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT1</name>
									<description>Select external trigger LPTnT1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT2</name>
									<description>Select external trigger LPTnT2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT3</name>
									<description>Select external trigger LPTnT3.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT4</name>
									<description>Select external trigger LPTnT4.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT5</name>
									<description>Select external trigger LPTnT5.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT6</name>
									<description>Select external trigger LPTnT6.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT7</name>
									<description>Select external trigger LPTnT7.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT8</name>
									<description>Select external trigger LPTnT8.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT9</name>
									<description>Select external trigger LPTnT9.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT10</name>
									<description>Select external trigger LPTnT10.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT11</name>
									<description>Select external trigger LPTnT11.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT12</name>
									<description>Select external trigger LPTnT12.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT13</name>
									<description>Select external trigger LPTnT13.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT14</name>
									<description>Select external trigger LPTnT14.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT15</name>
									<description>Select external trigger LPTnT15.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMRSET</name>
							<description>Timer Set. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to TMRSET initiates a copy of the value from the COUNT register into the internal timer register. This field is automatically cleared by hardware when the copy is complete and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMRCAP</name>
							<description>Timer Capture. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to TMRCAP initiates a read of internal timer register into the COUNT register. This field is automatically cleared by hardware when the operation completes and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSMDEN</name>
							<description>High Speed Timer Access Mode Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable high speed timer access mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable high speed timer access mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0EN</name>
							<description>Timer Compare 0 Threshold Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1EN</name>
							<description>Timer Compare 1 Threshold Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTEN</name>
							<description>Output Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the LPTIMER0 output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the LPTIMER0 output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFIEN</name>
							<description>Timer Overflow Interrupt Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the timer overflow interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the timer overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0IEN</name>
							<description>Timer Compare 0 Event Interrupt Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the timer compare 0 event interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the timer compare 0 event interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFOEN</name>
							<description>Timer Overflow Output Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer overflows do not modify the Low Power Timer output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer overflows set the Low Power Timer output to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0OEN</name>
							<description>Timer Compare 0 Event Output Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare 0 events do not modify the Low Power Timer output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare 0 events clear the Low Power Timer output to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1IEN</name>
							<description>Timer Compare 1 Event Interrupt Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the timer compare 1 event interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the timer compare 1 event interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1OEN</name>
							<description>Timer Compare 1 Event Output Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare 1 events do not modify the Low Power Timer output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare 1 events set the Low Power Timer output to 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OUTINVEN</name>
							<description>Output Inversion Enable. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not invert the LPTIMER0 output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Invert the LPTIMER0 output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0RSTEN</name>
							<description>Timer Compare 0 Event Reset Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare 0 events do not reset the timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare 0 events reset the timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1RSTEN</name>
							<description>Timer Compare 1 Event Reset Enable. </description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare 1 events do not reset the timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare 1 events reset the timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCLKEN</name>
							<description>Low Power Timer Module Clock Enable. </description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the clock to the Low Power Timer module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the clock to the Low Power Timer module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>Low Power Timer Debug Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The Low Power Timer module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the Low Power Timer module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RUN</name>
							<description>Timer Run Control and Compare Threshold Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the timer and disable the compare threshold.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start the timer running and enable the compare threshold.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COUNT</name>
					<description>Timer Value</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIMER</name>
							<description>Timer Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>THRESHOLD</name>
					<description>Threshold Values</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COMPARE0</name>
							<description>Timer Compare 0 Threshold Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>COMPARE1</name>
							<description>Timer Compare 1 Threshold Value. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OVFI</name>
							<description>Timer Overflow Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timer overflow has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timer overflow occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0I</name>
							<description>Timer Compare 0 Event Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timer compare 0 event has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timer compare 0 event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1I</name>
							<description>Timer Compare 1 Event Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timer compare 1 event has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timer compare 1 event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
